pyocd/pyOCD/pyocd/debug/svd/data/HC32M423.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CMU</name>
            <description>desc CMU</description>
            <baseAddress>0x40054400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4D</size>
            </addressBlock>
            <registers>
                <register>
                    <name>ADCKSEL</name>
                    <description>desc ADCKSEL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>ADCKSEL</name>
                            <description>desc ADCKSEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALSTDSR</name>
                    <description>desc XTALSTDSR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTDF</name>
                            <description>desc XTALSTDF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCFGR</name>
                    <description>desc SCFGR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7007007</resetMask>
                    <fields>
                        <field>
                            <name>PCLK1S</name>
                            <description>desc PCLK1S</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK4S</name>
                            <description>desc PCLK4S</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLKS</name>
                            <description>desc HCLKS</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKSWR</name>
                    <description>desc CKSWR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>CKSW</name>
                            <description>desc CKSW</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALCR</name>
                    <description>desc XTALCR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTP</name>
                            <description>desc XTALSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALCFGR</name>
                    <description>desc XTALCFGR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xF0</resetMask>
                    <fields>
                        <field>
                            <name>XTALDRV</name>
                            <description>desc XTALDRV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALMS</name>
                            <description>desc XTALMS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUPDRV</name>
                            <description>desc SUPDRV</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALSTBCR</name>
                    <description>desc XTALSTBCR</description>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTB</name>
                            <description>desc XTALSTB</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRCCR</name>
                    <description>desc HRCCR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTP</name>
                            <description>desc HRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRCCFGR</name>
                    <description>desc HRCCFGR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>HRCFREQS</name>
                            <description>desc HRCFREQS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSCSTBSR</name>
                    <description>desc OSCSTBSR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x29</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTBF</name>
                            <description>desc HRCSTBF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>XTALSTBF</name>
                            <description>desc XTALSTBF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MPLLSTBF</name>
                            <description>desc MPLLSTBF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCOCFGR</name>
                    <description>desc MCOCFGR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MCO1SEL</name>
                            <description>desc MCO1SEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO1DIV</name>
                            <description>desc MCO1DIV</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO1EN</name>
                            <description>desc MCO1EN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALSTDCR</name>
                    <description>desc XTALSTDCR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x87</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTDIE</name>
                            <description>desc XTALSTDIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDRE</name>
                            <description>desc XTALSTDRE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDRIS</name>
                            <description>desc XTALSTDRIS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDE</name>
                            <description>desc XTALSTDE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCG</name>
                    <description>desc FCG</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x3F7F0FB7</resetMask>
                    <fields>
                        <field>
                            <name>ADC</name>
                            <description>desc ADC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTC</name>
                            <description>desc CTC</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP</name>
                            <description>desc CMP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AOS</name>
                            <description>desc AOS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA</name>
                            <description>desc DMA</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRC</name>
                            <description>desc CRC</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMA1</name>
                            <description>desc TIMA1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMA2</name>
                            <description>desc TIMA2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMA3</name>
                            <description>desc TIMA3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMA4</name>
                            <description>desc TIMA4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM0_1</name>
                            <description>desc TIM0_1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM0_2</name>
                            <description>desc TIM0_2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM4_1</name>
                            <description>desc TIM4_1</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMB_1</name>
                            <description>desc TIMB_1</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMB</name>
                            <description>desc EMB</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCM</name>
                            <description>desc FCM</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU</name>
                            <description>desc DCU</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART1</name>
                            <description>desc UART1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART2</name>
                            <description>desc UART2</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART3</name>
                            <description>desc UART3</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART4</name>
                            <description>desc UART4</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IIC_1</name>
                            <description>desc IIC_1</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI_1</name>
                            <description>desc SPI_1</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRCCR</name>
                    <description>desc LRCCR</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>LRCSTP</name>
                            <description>desc LRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MRCCR</name>
                    <description>desc MRCCR</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>MRCSTP</name>
                            <description>desc MRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
