pyocd/pyOCD/pyocd/debug/svd/data/HC32M423.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CTC</name>
            <description>desc CTC</description>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F00F7</resetMask>
                    <fields>
                        <field>
                            <name>REFPSC</name>
                            <description>desc REFPSC</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REFCKS</name>
                            <description>desc REFCKS</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>desc ERRIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTCEN</name>
                            <description>desc CTCEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRMVAL</name>
                            <description>desc TRMVAL</description>
                            <msb>21</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <description>desc CR2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>OFSVAL</name>
                            <description>desc OFSVAL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RLDVAL</name>
                            <description>desc RLDVAL</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>TRIMOK</name>
                            <description>desc TRIMOK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TRMOVF</name>
                            <description>desc TRMOVF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TRMUDF</name>
                            <description>desc TRMUDF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTCBSY</name>
                            <description>desc CTCBSY</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>DAC</name>
            <description>desc DAC</description>
            <baseAddress>0x4004A100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xE</size>
            </addressBlock>
            <registers>
                <register>
                    <name>DADR1</name>
                    <description>desc DADR1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>desc DATA1</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>desc DATA2</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACR1</name>
                    <description>desc DACR1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x101</resetMask>
                    <fields>
                        <field>
                            <name>DAEN</name>
                            <description>desc DAEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALGN</name>
                            <description>desc ALGN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DADC1</name>
                    <description>desc DADC1</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF01</resetMask>
                    <fields>
                        <field>
                            <name>DASW</name>
                            <description>desc DASW</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WPRT</name>
                            <description>desc WPRT</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
