pyocd/pyOCD/pyocd/debug/svd/data/HC32M423.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DBGC</name>
            <description>desc DBGC</description>
            <baseAddress>0xE0042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
            <registers>
                <register>
                    <name>AUTHID0</name>
                    <description>desc AUTHID0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>AUTHID1</name>
                    <description>desc AUTHID1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>AUTHID2</name>
                    <description>desc AUTHID2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>RESV0</name>
                    <description>desc RESV0</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MCUSTAT</name>
                    <description>desc MCUSTAT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x30F</resetMask>
                    <fields>
                        <field>
                            <name>DBG_AUTH</name>
                            <description>desc DBG_AUTH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMC_REMVLOCK</name>
                            <description>desc FMC_REMVLOCK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMC_SAFTYLOCK1</name>
                            <description>desc FMC_SAFTYLOCK1</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMC_SAFTYLOCK2</name>
                            <description>desc FMC_SAFTYLOCK2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCUSTAT0</name>
                            <description>desc MCUSTAT0</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCUSTAT1</name>
                            <description>desc MCUSTAT1</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUCTL</name>
                    <description>desc MCUCTL</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x103</resetMask>
                    <fields>
                        <field>
                            <name>EDBGRQ</name>
                            <description>desc EDBGRQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESTART</name>
                            <description>desc RESTART</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBG_IRQ</name>
                            <description>desc DBG_IRQ</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FMCCTL</name>
                    <description>desc FMCCTL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>ERASEREQ</name>
                            <description>desc ERASEREQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERASEACK</name>
                            <description>desc ERASEACK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERASEERR</name>
                            <description>desc ERASEERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
