pyocd/pyOCD/pyocd/debug/svd/data/HC32M423.svd
                <register>
                    <name>PCRE2</name>
                    <description>desc PCRE2</description>
                    <addressOffset>0x5C8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x777</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRE2</name>
                    <description>desc PFSRE2</description>
                    <addressOffset>0x5CA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>I2C</name>
            <description>desc I2C</description>
            <baseAddress>0x4004E000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x34</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0x87FF</resetMask>
                    <fields>
                        <field>
                            <name>PE</name>
                            <description>desc PE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBUS</name>
                            <description>desc SMBUS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBALRTEN</name>
                            <description>desc SMBALRTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBDEFAULTE</name>
                            <description>desc SMBDEFAULTE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBHOSTEN</name>
                            <description>desc SMBHOSTEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FACKEN</name>
                            <description>desc FACKEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GCEN</name>
                            <description>desc GCEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESTART</name>
                            <description>desc RESTART</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>desc STOP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>desc ACK</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>desc SWRST</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <description>desc CR2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF012DF</resetMask>
                    <fields>
                        <field>
                            <name>STARTIE</name>
                            <description>desc STARTIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR0IE</name>
                            <description>desc SLADDR0IE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR1IE</name>
                            <description>desc SLADDR1IE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TENDIE</name>
                            <description>desc TENDIE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STOPIE</name>
                            <description>desc STOPIE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RFULLIE</name>
                            <description>desc RFULLIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEMPTYIE</name>
                            <description>desc TEMPTYIE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARLOIE</name>
                            <description>desc ARLOIE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NACKIE</name>
                            <description>desc NACKIE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GENCALLIE</name>
                            <description>desc GENCALLIE</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBDEFAULTIE</name>
                            <description>desc SMBDEFAULTIE</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBHOSTIE</name>
                            <description>desc SMBHOSTIE</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMBALRTIE</name>
                            <description>desc SMBALRTIE</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLR0</name>
                    <description>desc SLR0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0x93FF</resetMask>
                    <fields>
                        <field>
                            <name>SLADDR0</name>
                            <description>desc SLADDR0</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR0EN</name>
                            <description>desc SLADDR0EN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRMOD0</name>
                            <description>desc ADDRMOD0</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLR1</name>
                    <description>desc SLR1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x93FF</resetMask>
                    <fields>
                        <field>
                            <name>SLADDR1</name>
                            <description>desc SLADDR1</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLADDR1EN</name>
                            <description>desc SLADDR1EN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRMOD1</name>
                            <description>desc ADDRMOD1</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF716DF</resetMask>
                    <fields>
                        <field>
                            <name>STARTF</name>
                            <description>desc STARTF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SLADDR0F</name>
                            <description>desc SLADDR0F</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SLADDR1F</name>
                            <description>desc SLADDR1F</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TENDF</name>
                            <description>desc TENDF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STOPF</name>
                            <description>desc STOPF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFULLF</name>
                            <description>desc RFULLF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TEMPTYF</name>
                            <description>desc TEMPTYF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ARLOF</name>
                            <description>desc ARLOF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ACKRF</name>
                            <description>desc ACKRF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NACKF</name>
                            <description>desc NACKF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSL</name>
                            <description>desc MSL</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>desc BUSY</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TRA</name>
                            <description>desc TRA</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GENCALLF</name>
                            <description>desc GENCALLF</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SMBDEFAULTF</name>
                            <description>desc SMBDEFAULTF</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SMBHOSTF</name>
                            <description>desc SMBHOSTF</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SMBALRTF</name>
                            <description>desc SMBALRTF</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
